
<h1>Реестр проверок</h1>
<p>Действия по развертыванию описаны на
    <a href="https://github.com/gitpirojoke/audit-register.git">github</a>
</p>
<p>Шаблон testSBS.xlx для импорта расположен в корне</p>
<p>Основной функционал работает, но все возможные проверки реализовать не успел.</p>
<p>Для коректной работы требуется интернет соединение, т.к. используется CDN контент</p>
<p>Поля ввода даты Datepicker</p>
<p>Поля выбора с поиском смп и аудитора Select2</p>
<p>Работа с excel через phpspreadsheet</p>
<p>Филтры с пагинацией на стороне сервера</p>
<p>Генерация СМП как организаций через faker</p>
